// BoardData.js
export const noticeData = [
  { 
    id: 7, 
    title: "행정안전부 재난안전데이터 공유플랫폼 안내", 
    author: "관리자", 
    date: "2025-04-11", 
    isPin: true,
    files: [
      { name: "재난안전데이터 공유플랫폼 리플렛.pdf", url: "/files/leaflet.pdf" }
    ],
    content: `행정안전부 재난안전데이터 공유플랫폼 안내 본문입니다.

○ 근거
가. 재난 및 안전관리 기본법 제 74조의4(재난안전데이터의 수집 등)
나. 동법 시행령 제83조의 3(재난안전데이터통합관리시스템의 운영 등)

○ 행정안전부에서는 위 법령에 근거하여 기관별 분산되어있는 재난안전데이터를 한 곳에 모아 통합 제공하고자, 재난안전유형 62종에 대한 1,800여 개의 재난안전데이터를 오픈API 방식으로 제공하는 재난안전데이터 공유플랫폼을 구축, '25년 1월부로 정식서비스를 게시하였습니다.

○ 점점 복잡하고 다양해지는 재난에 효과적으로 대응하기 위하여 데이터를 활용한 과학적이고 체계적인 재난안전 관리체계로의 전환이 필요한 시점으로, 재난안전데이터 공유플랫폼을 통해 데이터 활용을 위한 기초적인 기반을 마련하였으며 올해를 재난안전데이터 활용의 원년으로 삼아, 데이터 활용 우수 사례를 적극 발굴하여 전파하고 실효성 있는 재난안전데이터를 지속 개발·하기 위해 노력하고 있습니다.

* 기관별 파일데이터 등록 또는 API, ESB, DB2DB 방식으로 데이터 연계 및 개방 가능
○ 이에 공공·민간에서 활용*할 수 있도록 재난안전데이터 공유플랫폼(www.safetydata.go.kr)에 대하여 안내 드리오니 많은 관심부탁드립니다.
* 데이터 시각화 및 분석, 앱·시스템 개발, 논문·연구, 수업, 공부, 과제 등

출처 : 서울안전누리 (https://safecity.seoul.go.kr/board/ntcMttr/boardNtcMttrDetail.page)`
  }, 
  { 
    id: 8, 
    title: "전북특별자치도 '25년도 11월 재난 현황 정리입니다", 
    author: "관리자", 
    date: "2025-12-08", 
    isPin: true,
    files: [
      { name: "25년11월_재난현황.pdf", url: "/files/report_nov.pdf" },
      { name: "참고이미지.png", url: "/files/reference_img.png" }
    ],
    content: `2025년 11월 전북특별자치도 재난 현황 정리 내역입니다.
한 달간 발생한 주요 사건사고를 공유드립니다. 

상세 내용은 첨부된 PDF 파일을 확인해 주시기 바랍니다.` 
  },
  { 
    id: 1, 
    title: "전북특별자치도 새롭게 추가된 쉼터 목록입니다", 
    author: "관리자", 
    date: "2025-12-06", 
    isPin: false,
    files: [
      { name: "25년11월_쉼터 목록.pdf", url: "/files/report_nov.pdf" },
      { name: "참고이미지_쉼터목록.png", url: "/files/reference_img.png" }
    ],
    content: `새롭게 지정된 전북 지역 내 무더위/한파 쉼터 목록을 안내드립니다.
도민 여러분께서는 인근 쉼터 위치를 미리 확인하시어 안전한 겨울 보내시기 바랍니다.` 
  },
  { 
    id: 2, 
    title: "전북특별자치도 새롭게 추가된 대피소 목록입니다", 
    author: "관리자", 
    date: "2025-11-25", 
    isPin: false,
    files: [
      { name: "25년_대피소_추가목록.pdf", url: "/files/report_nov.pdf" },
      { name: "참고이미지_대피소목록.png", url: "/files/reference_img.png" },
      { name: "전북특별자치도_25년_대피소_추가목록.hwp", url: "/files/press_03.hwp" }
    ],
    content: `새롭게 추가된 전북 지역 내 대피소 목록을 안내드립니다.
도민 여러분께서는 인근 대피소 목록 위치를 미리 확인하기 바랍니다.` 
  },
  { 
    id: 3, 
    title: "전북 특별자치도 겨울철 재난 대비 요령입니다", 
    author: "관리자", 
    date: "2025-11-11", 
    isPin: false,
    files: [
      { name: "겨울철재난대비요령.pdf", url: "/files/report_nov.pdf" },
      
    ],
    content: `전북 특별자치도 겨울철 재난 대비 요령입니다.
도민 여러분께서는 겨울철 재난 대비를 확인하시어 안전한 겨울 보내시기 바랍니다. ` 
  },
  { 
    id: 4, 
    title: "겨울철 동파 대비, 이렇게 대비하세요", 
    author: "관리자", 
    date: "2025-11-02", 
    isPin: false,
    files: [
      { name: "겨울철동파대비.pdf", url: "/files/report_nov.pdf" },
      
    ],
    content: `전북 특별자치도 겨울철 동파 대비, 이렇게 대비하세요.
도민 여러분께서는 겨울철 동파 재난 대비를 확인하시어 안전한 겨울 보내시기 바랍니다. ` 
  },
  { 
    id: 5, 
    title: "한파정보 받고 부모님께 효도 안부전화드리기 캠페인", 
    author: "관리자", 
    date: "2025-10-30", 
    isPin: false,
    files: [
     
      
    ],
    content: `한파정보 받고 부모님께 효도 안부전화드리기 캠페인을 실천해보세요!
     ` 
  },
  { 
    id: 6, 
    title: "전북자치도, 도민 누구나 안전보험 혜택 받는다!", 
    author: "관리자", 
    date: "2025-10-20", 
    isPin: false,
    files: [
      { name: "전북자치도, 도민 누구나 안전보험 혜택 받는다.hwp", url:  "/files/press_01.hwp" },
      
    ],
    content: `전북자치도, 도민 누구나 안전보험 혜택 받는다!의 내용입니다.

    출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=1&key=&val=&CAT_ID=0&BID=3986&cmd=view) ` 
  },
  { 
    id: 9, 
    title: "2025년 지진안전주간 안내", 
    author: "관리자", 
    date: "2025-10-16", 
    isPin: false,
    files: [
      { name: "2025년 지진안전주간 포스터.pdf", url: "/files/report_nov.pdf" },
      
    ],
    content: `행정안전부는 2016년 경주 지진 발생을 계기로 매년 한 주간을 '지진안전주간'으로 정하고 전국민을 대상으로 지진 행동요령을 집중 홍보하고 있습니다.
2025년 '지진안전주간'은 10월 20일(월)부터 10월 26일(일)까지 입니다. ` 
  },
  { 
    id: 10, 
    title: "이번 여름 이것만은 꼭 지키자. 폭염행동요령", 
    author: "관리자", 
    date: "2025-07-09", 
    isPin: false,
    files: [
      
      
    ],
    content: `이번 여름 이것만은 꼭 지키자
폭염행동요령
폭염이란? 기온이 매우 높은 상태가 일정기간 지속되는 심한더위
폭염경보 : 일 최고 체감온도 35도 이상인 상태가 2일이상 지속 예상될때
폭염주의보 : 일 최고 체감온도 22도 이상인 상태가 2일 이상 지속 예상될때
온열질환은? 열로인해 발생하는 급성질환
증상: 고온환경에서 장시간 노출시 두통, 어지럼증, 근육경련, 피로감, 의식저하 등의 증상 발생가능
종류: 대표적으로 열사병, 열탈진, 열경련, 열발진(땀띠)
수분더하기
야외활동 및 신체노출 빼기
시원한 장소 휴식 곱하기
기상정보, 가족이웃 안전나누기
폭염 행동요령 실천! 건강한 여름나기를 위한 첫걸음

출처: 서울안전누리 (https://safecity.seoul.go.kr/board/ntcMttr/boardNtcMttrDetail.page) ` 
  },
  { 
    id: 11, 
    title: "열대야를 슬기롭게 이겨내는 건강수칙", 
    author: "관리자", 
    date: "2025-07-09", 
    isPin: false,
    files: [
      
    ],
    content: `열대야를 슬기롭게 이겨내는 건강수칙


열대야로 인한 주요 증상

피로 누적, 집중력 저하, 두통, 식욕부진, 불면증

증상이 지속될 경우 만성화될 수 있으며,

기저질환이 있는 경우

해당 질환의 악화와 합병증이 발생할 수 있습니다.


열대야 란?

낮시간 동안 올라간 지면의 온도와 열이 식지 않아 밤시간(오후 6시~다음날 오전 9시 사이) 최저기온이 25℃ 이하로 내려가지 않는 현상

※ 2024년 열대야 일수(24.5일)는 1973년 이래 1위 기록

(출처:기상청, 6~9월 열대야 일수 반영)


열대야 건강수칙

1. 취침 전 준비하기

취침 전, 과식 습관을 줄이고, 알코올과 카페인 멀리하기

충분한 수분을 섭취하되, 취침 전 과도한 수분 섭취 삼가기

* 평소 생활습관과 건강상태를 고려하여 적정량 섭취하기

수면 1-2시간 전 미지근한 물로 목욕이나 샤워하기

* 지나치게 차가운 물은 숙면에 방해 될 수 있음


열대야 건강수칙

2.시원하게 취침하기

과도한 운동이나 강도 높은 운동 자제하기

* 고강도 운동은 심부체온을 올라가게 하여 수면에 방해 될 수 있음

실내가 시원하고 쾌적하게 유지되도록 온도와 습도 관리하기

* 실내 온도 24-26℃, 습도 50% 내외를 유지하되, 건강상태를 고려하여 온도와 습도를 조절하기

통풍이 잘 되는 헐렁한 옷을 착용하고, 시원한 침구 사용하기


열대야 건강수칙

3. 건강한 일상생활하기

열대야 관련 날씨 정보와 예보·특보 확인하기

지나친 낮잠은 피하고 규칙적인 취침 시간 유지하기

기저질환(당뇨병, 고혈압 등)이 있다면 적극적으로 관리하기


열사병 등 온열질환 의심시 조치

의식 유무

의식 있음

→ 시원한 장소로 이동

→ 옷을 헐렁하게 하고 몸을 시원하게 함

→ 수분 섭취

→ 증상이 개선되지 않을 경우

→ 119 구급대 요청

→ 병원으로 후송

의식 없음

→ 119 구급대 요청

→ 시원한 장소로 이동

→ 옷을 헐렁하게 하고 몸을 시원하게 함

→ 병원으로 후송

※ 의식이 없을 경우 수분 섭취 절대 금지


열대야 건강수칙과 함께

열대야를 이기고, 건강한 여름 보내세요!

출처: 서울안전누리 (https://safecity.seoul.go.kr/board/ntcMttr/boardNtcMttrDetail.page) `

  },
  { 
    id: 12, 
    title: "전북 특별자치도 겨울철 재난 대비 요령입니다", 
    author: "관리자", 
    date: "2025-11-11", 
    isPin: false,
    files: [
      { name: "겨울철재난대비요령.pdf", url: "/files/report_nov.pdf" },
      
    ],
    content: `전북 특별자치도 겨울철 재난 대비 요령입니다.
    도민 여러분께서는 겨울철 재난 대비를 확인하시어 안전한 겨울 보내시기 바랍니다. ` 
  },
  { 
    id: 13, 
    title: "전북 특별자치도 겨울철 재난 대비 요령입니다", 
    author: "관리자", 
    date: "2025-11-11", 
    isPin: false,
    files: [
      { name: "겨울철재난대비요령.pdf", url: "/files/report_nov.pdf" },
      
    ],
    content: `전북 특별자치도 겨울철 재난 대비 요령입니다.
    도민 여러분께서는 겨울철 재난 대비를 확인하시어 안전한 겨울 보내시기 바랍니다. ` 
  }
  
  



];

export const pressData = [
  { 
    id: 1, 
    title: "전북특별자치도 지진방재 국제세미나 개최", 
    author: "관리자", 
    date: "2025-11-11", 
    isPin: false,
    files: [
      { name: "전북특별자치도_지진방재국제세미나계획.hwp", url: "/files/press_01.hwp" }
    ],
    content: `전북특별자치도 지진방재 국제세미나 개최

□ 개요
 ○ (행사주제) 지진위험을 고려한 내진설계와 단층조사의 실질적 해법 모색
 ○ (일시/장소) '25.11.22.(수) 13:40~17:00 / 공연장
 ○ (주최/주관) 행정안전부, (사)한국지진공학회 공동 주최
    - 국립재난안전연구원, 전북특별자치도, 한국지질자원연구원, (주)한국지진공학회
 ○ (참석자) 국외(일본, 캐나다, 뉴질랜드) 내진/단층 전문가, 국내 중앙 및 시·군 공무원, 대학, 연구기관 및 기업 관계자 등 200여명

출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mp=m6_1) `
  }, 
  { 
    id: 2, 
    title: "전북특별자치도, 2026년 재해예방사업 국비 1,054억 확보", 
    author: "관리자", 
    date: "2025-11-11", 
    isPin: false,
    files: [
      { name: "2026년_재해예방사업_국비확보내역.hwp", url: "/files/press_02.hwp" }
    ],
    content: `전북특별자치도가 2026년 재해예방사업을 위한 국비 1,054억 원을 확보했습니다.

이번 예산 확보를 통해 도내 기습 폭우 및 상습 침수 구역에 대한 정비 사업이 가속화될 전망입니다. 
도민들의 생명과 재산을 보호하기 위해 노후 위험 시설 보강에 최선을 다하겠습니다.

출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mp=m6_1) ` 
  },
  { 
    id: 3, 
    title: "전북특별자치도 여름철 자연재난 인명피해 '0명'", 
    author: "관리자", 
    date: "2025-11-11", 
    isPin: false,
    files: [{ name: "여름철_자연재난_대응실적보고.hwp", url: "/files/press_03.hwp" }],
    content: `전북특별자치도는 올 여름철 자연재난 대책 기간 동안 철저한 상황 관리와 
선제적인 통제를 통해 단 한 명의 인명피해도 발생하지 않았음을 알려드립니다.

민·관이 합심하여 이루어낸 결과이며, 앞으로도 재난 없는 전북을 위해 노력하겠습니다.

출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mp=m6_1)` 
  },
  { 
    id: 4, 
    title: "한가위 연휴기간 축제 전북도 민관합동점검 안전관리 총력!", 
    author: "관리자", 
    date: "2025-10-24", 
    isPin: false,
    files: [{ name: "251001한가위연휴기간 축제 전북도 민관합동점검 안전관리 총력.hwpx", url: "/files/press_04.hwp" }],
    content: `전북특별자치도는 다가오는 추석 명절을 맞아 귀성객과 관광객이 대거 방문할 것으로
 예상됨에 따라, 명절기간 중 지역 내 주요 축제에 대한 안전점검을 한층 강화한다고 밝혔다.

지역축제의 경우 대부분 야외에서 진행되어 위험 요인이 많고 안전사고에 취약함에 따라 
 도에서는 시·군을 비롯해 소방서, 경찰서, 한국전기안전공사, 한국가스안전공사 등의
 유관기관과 민간전문가로 점검반을 구성하여 중점적으로 확인할 예정이다.

출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mp=m6_1) ` 
  },
  { 
    id: 5, 
    title: "전북자치도, 안전점검의 날 교통안전 캠페인 전개", 
    author: "관리자", 
    date: "2025-09-25", 
    isPin: false,
    files: [{ name: "250904 민관 합동 안전문화 캠페인 실시(9월 안전점검의 날) 보도자료.hwp", url: "/files/press_05.hwp" }],
    content: `전북특별자치도가 4일 완주 봉동초등학교 일원에서 안전한 학교 환경 조성을 위한 민관 합동 교통안전 캠페인을 실시했다. 

이번 캠페인은 안전점검의 날*(매월4일)을 맞아 개학기 통학로 주변 어린이 교통사고 예방을 위해 마련된 행사로 완주군, 완주경찰서, 안전모니터봉사단 등 민간안전단체와 봉동초등학교 안전히어로즈 어린이 7명이 함께 참여하여 뜻깊은 시간이 되었다.
 *『재난 및 안전관리 기본법 시행령』제73조의6 매월 4일 안전의식 고취 행사 등 추진
    
출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mp=m6_1)` 
  },
  { 
    id: 6, 
    title: "전북도, 상반기 안전신문고 우수 신고자 선정 포상", 
    author: "관리자", 
    date: "	2025-09-25", 
    isPin: false,
    files: [{ name: "250827 보도자료-전북도, 상반기 안전신문고 우수 신고자 선정 포상.hwpx", url: "/files/press_06.hwp" }],
    content: `2025년 상반기 안전신문고 우수 신고자 포상 관련 보도자료입니다.
    
출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=1&key=&val=&CAT_ID=0&BID=3956&cmd=view) ` 
  },
  { 
    id: 7, 
    title: "전북자치도, 가을축제 안전관리 우리가 간다!", 
    author: "관리자", 
    date: "	2025-09-24", 
    isPin: false,
    files: [{ name: " 250908 보도자료_전북자치도, 가을축제 안전관리 우리가 간다!(수정).hwp", url: "/files/press_06_1.hwp" }],
    content: `가을축제 안전관리 점검관련 보도자료 입니다.

출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=1&key=&val=&CAT_ID=0&BID=3954&cmd=view)` 
  },
  { 
    id: 8, 
    title: "전북자치도, ‘찾아가는 중대재해 예방 컨설팅’으로", 
    author: "관리자", 
    date: "2025-09-24", 
    isPin: false,
    files: [{ name: "전북자치도, ‘찾아가는 중대재해 예방 컨설팅’으로.hwpx", url: "/files/press_07.hwp" }],
    content: `중대재해예방 컨설팅 관련 보도자료 입니다.
    
출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=1&key=&val=&CAT_ID=0&BID=3953&cmd=view)    ` 
  },
  { 
    id: 9, 
    title: "전북도, 물놀이 안전 현장점검·응급처치 교육병행 등을 통한 도민 안심 여름 조성", 
    author: "관리자", 
    date: "2025-09-24", 
    isPin: false,
    files: [{ name: "250704 보도자료-전북도, 물놀이 안전 사전점검·응급처치 교육 병행… 도민 안심 여름 조성.hwp", url: "/files/press_08.hwp" }],
    content: `물놀이 안전 현장점검·응급처치 교육병행 등을 통한 도민 안심 여름 조성관련 보도자료 입니다.
    
출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=1&key=&val=&CAT_ID=0&BID=3952&cmd=view) ` 
  },
  { 
    id: 10, 
    title: "전북자치도, 2025년 국민안전교육 '최우수 기관' 선정", 
    author: "관리자", 
    date: "2025-09-24", 
    isPin: false,
    files: [{ name: "250730 보도자료-전북자치도, 2025년 국민안전교육 최우수 기관 선정.hwp", url: "/files/press_09.hwp" }],
    content: `2025년 국민안전교육 최우수 기관 전북자치도 선정관련 보도자료 입니다.

출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=1&key=&val=&CAT_ID=0&BID=3951&cmd=view) ` 
  },   

  { 
    id: 11, 
    title: "전북자치도, 가정의 달 지역축제 등 안전관리 강화", 
    author: "관리자", 
    date: "2025-09-24", 
    isPin: false,
    files: [{ name: "250501 전북특별자치도, 가정의 달 지역축제 등 안전관리 강화.hwp", url: "/files/press_09.hwp" }],
    content: `가정의 달 지역축제 등 안전관리 강화 관련 보도자료 입니다.
    
출처 : 전북안전대책본부 (https://u-safe.jeonbuk.go.kr/index.php?mt=page&mp=m6_1&mm=oxbbs&oxid=1&cpage=2&key=&val=&CAT_ID=0&BID=3950&cmd=view)    ` 
  },
  

];